Revit 2024 API
MechanicalEquipmentSet.Create Method
 Creates a new instance of a mechanical equipment set and adds it to the document.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public static MechanicalEquipmentSet Create(
	Document document,
	ElementId typeId,
	ISet<ElementId> memberIds
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	typeId As ElementId, _
	memberIds As ISet(Of ElementId) _
) As MechanicalEquipmentSet
Visual C++
public:
static MechanicalEquipmentSet^ Create(
	Document^ document,
	ElementId^ typeId,
	ISet<ElementId^>^ memberIds
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document where the element will be created and added.
typeId
Type: Autodesk.Revit.DB.ElementId
 The type of new mechanical equipment set.
memberIds
Type: System.Collections.Generic.ISet<ElementId>
 The member elements of this mechanical equipment set.
Return Value
 The newly created mechanical equipment set.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Invalid mechanical equipment set type. -or- This mechanical equipment set needs at least two members. -or- The valid members must have the same classification and system. A valid member cannot be a member of any other existing set. -or- These elements are serially connected.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace